{
    "DeescalationSuggestions": {
        "triggers": ["alert", "caution"],
        "byAttachmentStyle": {

        "anxious": [
        {
        "text": "Try: \"I'm feeling a bit overwhelmed right now. Can we pause and come back to this in a few minutes?\""
        },
        {
            "text": "Try: \"I'm getting anxious about this conversation. Can we take a moment to breathe together?\""
        },
        {
            "text": "Try: \"I'm feeling a bit shaky. Can we agree to take a short break and check in with each other?\""
        },
        {
            "text": "Try: \"I'm worried I'm not hearing you clearly. Can we slow down and clarify our points?\""
        },
        {
            "text": "Try: \"I can feel my anxiety rising. Would it help if we took a quick walk or stretch?\""
        },
        {
        "text": "Try: \"My heart's racing—I'd like to take three deep breaths together before we continue.\""
        },
        {
        "text": "Try: \"I care about what you're saying, but I need a moment to calm down. Let's pick this up shortly.\""
        },
        {
            "text": "Try: \"I'm feeling a bit panicky. Can we agree to pause and come back to this later?\""
        },
        {
            "text": "Try: \"I'm feeling overwhelmed by my emotions. Can we take a step back and talk about this calmly?\""
        },
        {
            "text": "Try: \"I'm feeling a bit lost in this conversation. Can we take a moment to regroup?\""
        }
            ],

     "avoidant": [
    {
        "text": "Try: \"I need a moment to collect my thoughts. Can we pause and come back to this?\""
    },
    {
        "text": "Try: \"I'm feeling a bit overwhelmed right now. Can we take a short break?\""
    },
    {
        "text": "Try: \"I need some space to process this. Can we revisit it in a little while?\""
    },
    {
        "text": "Try: \"I'm not sure how to respond right now. Can we take a breather?\""
    },
    {
        "text": "Try: \"I'm feeling a bit anxious about this conversation. Can we slow down for a moment?\""
    },
    {
        "text": "Try: \"I think I need five minutes to clear my head—let's pick up after that.\""
    },
    {
        "text": "Try: \"My mind feels scattered—would stepping away briefly help me respond more clearly?\""
    },
    {
        "text": "Try: \"I need to step back for a moment to think—can we set a time to reconnect?\""
    },
    {
        "text": "Try: \"I'm finding this intense—could we pause here and reconvene in 10 minutes?\""
    },
    {
        "text": "Try: \"I'm feeling overloaded—would a quick break help me come back more present?\""
    },
    {
        "text": "Try: \"I need a little alone time to sort my thoughts—thank you for your patience.\""
    },
    {
        "text": "Try: \"I'm feeling emotionally full—can we pause and I'll check back soon?\""
    },
    {
        "text": "Try: \"I'd like a moment to breathe—can we circle back when I've had a chance to reset?\""
    },
    {
        "text": "Try: \"I'm noticing I'm pulling away—could we agree on a short pause and then resume?\""
    },
    {
        "text": "Try: \"I care about this talk, but I need a moment alone—let's reconnect shortly.\""
    }
],

     "disorganized": [
        {
        "text": "Try: \"This is bringing up a lot for me. Can we slow down and talk about one thing at a time?\""
        },
        {
        "text": "Try: \"I'm feeling overwhelmed by everything right now. Can we take a step back?\""
        },
        {
        "text": "Try: \"My thoughts are all over the place—can we focus on one point at a time?\""
        },
        {
        "text": "Try: \"I'm feeling scattered—can we take a moment to breathe and refocus?\""
        },
        {
        "text": "Try: \"I'm having trouble keeping up with everything—can we simplify this discussion?\""
        },
        {
        "text": "Try: \"I feel like I'm jumping around—could you help me by asking one question at a time?\""
        },
        {
        "text": "Try: \"My mind is racing—can we write down the main points and tackle them one by one?\""
         },
         {
        "text": "Try: \"I'm getting lost—would it help if we paused for a moment and re‑centered?\""
        },
        {
        "text": "Try: \"I'm confused by too many details—can we agree on the top three issues to address?\""
        },
        {
        "text": "Try: \"I keep spinning thoughts—could we take two minutes of silence to collect ourselves?\""
        },
        {
        "text": "Try: \"I feel pulled in different directions—can we pick one topic and stick with it?\""
         },
            {
        "text": "Try: \"My brain feels flooded—would a brief walk or stretch help us regroup?\""
         },
         {
        "text": "Try: \"I'm struggling to articulate this—would it help if I jotted down my concerns first?\""
         },
         {
        "text": "Try: \"I'm scattered—can we set a clear next step before moving on?\""
         },
         {
        "text": "Try: \"I'm overwhelmed by options—could we list the pros and cons together?\""
         }
],
                "secure": [
    {
        "text": "Try: \"I'm worried this is going sideways. Can we each share one thing we appreciate before proceeding?\""
    },
    {
        "text": "Try: \"I notice my voice is shaking. Would it help if we slowed our pace?\""
    },
    {
        "text": "Try: \"I'm getting lost in my thoughts—can we break for two minutes so I can gather myself?\""
    },
    {
        "text": "Try: \"I'm afraid I'm misunderstanding you—could you say that one more time gently?\""
    },
    {
        "text": "Try: \"I'm feeling a knot in my stomach—can we take a quick stretch or sip of water?\""
    },
    {
        "text": "Try: \"I want to be present but my mind is racing—can we agree on a short breath break?\""
    },
    {
        "text": "Try: \"I care so much that I'm panicking—can we name one concrete thing we agree on first?\""
    },
    {
        "text": "Try: \"My anxiety is spiking—can I text you an emoji when I need a moment to regroup?\""
    },
    {
        "text": "Try: \"I'm feeling insecure about where this is going—could we check in on each other's needs?\""
    },
    {
        "text": "Try: \"I realize I'm spiraling—can I jot down my main worry and share it with you?\""
    },
    {
        "text": "Try: \"I'm crumbling a bit—would it help if we paused for five deep breaths together?\""
    },
    {
        "text": "Try: \"I need a mini break to feel safe—can we return in two minutes?\""
    },
    {
        "text": "Try: \"My thoughts are fluttering—can we each take one turn to speak and then pause?\""
}
]
        }
}
}