{
  "fallbackRepairScripts": [
    "I want to repair our connection after this conflict.",
    "I value our relationship and want to work through this together.",
    "Can we find a way forward that honors both our needs?",
    "I'm committed to understanding your perspective better.",
    "Let's create a plan to prevent this type of conflict in the future.",
    "Let's take responsibility for our parts in this disagreement.",
    "I'm sorry for how I contributed to this—can we talk about what happened?",
    "I care about us and want to make this right—how can I do that?",
    "I realize I hurt you; can we discuss what I can do to fix it?",
    "I want to rebuild trust between us—what step should I take first?",
    "I regret my part in this conflict; would you be open to a fresh start?",
    "I miss our connection—can we find a solution that works for both?",
    "I know we both have feelings—can we share and then move forward?",
    "I appreciate how you feel—let me know how I can support your needs.",
    "I understand this was painful—can we agree on a way to heal?",
    "I want us to grow from this—what would help you feel safe again?",
    "I'm here to listen and learn—please tell me more about your view.",
    "I recognize my mistake—can we agree on an action to prevent recurrence?",
    "I care about how you feel—let's map out a path to repair together.",
    "I'd like to apologize properly—what would make things better for you?",
    "I want us to come out of this stronger—what do you need from me?",
    "I know I let you down—how can I regain your trust?",
    "I'm willing to change—let's agree on steps we both can take.",
    "I want to hear your needs—can we set aside time to discuss them?",
    "I'm sorry for my words—can we reframe what was said into understanding?",
    "I know this isn't easy—can we work on a compromise that honors us both?",
    "I value your perspective—help me understand so we can move forward.",
    "I regret the tension—can we agree on a cooling-off period and reconvene?",
    "I want to acknowledge my errors—would you like me to restate my intent?",
    "I'm committed to accountability—what would you consider a fair resolution?",
    "I'd like to clear the air—can we speak openly about our feelings?",
    "I care about our future—can we outline mutual expectations so this doesn't repeat?",
    "I want to honor your emotions—how can I best show my commitment to change?",
    "I respect your boundaries—let me know how to approach you respectfully moving forward.",
    "I'm seeking to make amends—would you be willing to share what you need most right now?",
    "I want to rebuild safety between us—what would help you feel safe again?",
    "I know apologies aren't enough—let's agree on actions that demonstrate change.",
    "I value honesty—can we agree to share our feelings without judgment to heal this rift?",
    "I'd like to co-create a resolution—what steps should we include in our plan?",
    "I'm committed to listening without interruption—let's set a time to talk this through.",
    "I want to ensure you feel heard—can we start by you sharing, and I'll actively listen?",
    "I recognize my part in this—would you prefer a written apology or a conversation?",
    "I'm here to hold space for your feelings—how would you like to proceed?",
    "I miss our harmony—what's one thing we can do together to restore it?",
    "I want us to move past this—can we agree on a signal to pause next time tension rises?",
    "I care deeply about us—let's check in weekly to ensure we're on the same page.",
    "I'm ready to make things better—can we brainstorm solutions together now?",
    "I apologize for my tone—how can I express myself more clearly?",
    "I realize I wasn't fully present—can we start over with focused attention?",
    "I know actions speak louder than words—what can I do today to show my commitment?",
    "I feel regret—can we discuss how I can make amends?",
    "I want to honor your feelings—what can I do to validate your experience?",
    "I know this hurt you—can you tell me how it felt so I understand better?",
    "I'm eager to learn from this—what feedback can you share?",
    "I care about your peace of mind—how can I help you feel at ease?",
    "I feel responsible—can we outline specific steps for moving forward?",
    "I want to rebuild our bond—what ritual or activity would help?",
    "I know apologies have limits—can we agree on a gesture that feels meaningful?",
    "I'm committed to growth—can we set mutual goals for improving communication?",
    "I want to make this right—what would be a fair way to start fresh?",
    "I respect your healing process—how can I support you along the way?",
    "I know trust takes time—can we agree on small steps to rebuild it?",
    "I care about our shared history—can we reflect on what brought us together?",
    "I want to align our expectations—can we discuss what each of us needs?",
    "I feel remorse—could we plan a concrete apology gesture that resonates?",
    "I want us to feel safe again—what boundaries or practices would help?",
    "I recognize the pain—can we set a timeframe for checking in on progress?",
    "I'm sorry for the disrespect—what can I do to restore your dignity?",
    "I want to repair the emotional distance—would regular check-ins help?",
    "I care about your well-being—how can I ease any lingering hurt?",
    "I want to co-create a healing process—what elements would you include?",
    "I'm willing to adapt—what behavior change matters most to you?",
    "I value our bond—can we plan a meaningful experience to reconnect?",
    "I feel regret—will you guide me on a step-by-step reconciliation?",
    "I want to honor our shared values—how can we reaffirm them together?",
    "I know I hurt you—can you share a moment you felt most affected?",
    "I'm here to walk this path with you—what's our first step?",
    "I want to demonstrate respect—what action would reflect that best?",
    "I'm committed to showing empathy—how can I practice that daily?",
    "I value us—could we schedule time for an open-hearted conversation?",
    "I want to ensure you feel safe—what ongoing practice would help maintain that?",
    "I'm ready to listen deeply—can you share your unfiltered thoughts?",
    "I want to acknowledge your pain—how would you like me to respond?",
    "I care about repairing the damage—would a written plan help?",
    "I'm seeking your guidance—how would you like to proceed together?",
    "I respect your pace of healing—what timeline feels comfortable to you?",
    "I want to make up for my mistakes—what is the most meaningful gesture I can offer?",
    "I understand this is hard—what support do you need from me this week?"
  ]
}