{
  "clear": [
    "I feel [emotion] when [situation] because [impact]. Could we [solution]?",
    "When [situation] happens, I notice I feel [emotion]. I'd like [need].",
    "I want to be clear: [state need]. How can we achieve that together?",
    "Here's what I'm experiencing: [experience]. Would it help if we [action]?",
    "My goal is [goal]. What do you think about [proposal]?",
    "To avoid confusion, I'd suggest [specific step]. Does that work?",
    "I appreciate [positive behavior]. Next, could we [request]?",
    "For clarity, here's my summary: [summary]. Let's plan [next step].",
    "When I hear [behavior], I feel [emotion] because [impact]. Can we try [alternative]?",
    "I value our communication. Would it be possible to [solution] when [situation] arises?",
    "I'm sensing [emotion] about [situation]. Could we discuss [proposal]?",
    "It helps me when you [behavior]. Could we agree to [new approach]?",
    "Sometimes I struggle with [issue]. Would you be open to [action]?",
    "I've noticed [pattern]. I feel [emotion]—how can we adjust [process]?",
    "I care about [topic]. Could we set aside time to [next step]?",
    "I'm concerned that [situation]. What if we [solution]?",
    "When [trigger] comes up, I get [emotion]. It might help to [action].",
    "I want to feel [positive state]. Could we try [behavior change]?",
    "I respect your viewpoint. Could you help me by [request]?",
    "I feel [emotion] when [context]. Would you consider [proposal]?",
    "To keep us aligned, I'd like to [action]. Are you comfortable with that?",
    "I enjoy our collaboration. Next time, can we [new routine]?",
    "I'm committed to improvement. Could we [step] to address [issue]?",
    "When things feel [negative state], I benefit from [support action].",
    "I value solutions—what if we [brainstorm option] together?",
    "I'm hoping to resolve [issue]. Can we agree on [plan]?",
    "I need to understand your perspective—could you share [detail]?",
    "To move forward, I suggest [concrete step]. How does that sound?",
    "I appreciate your help with [task]. Could we follow up on [next item]?",
    "I feel more confident when [supporting behavior]. Would you be willing to [request]?",
    "I'm open to feedback on [topic]. Could you let me know if [scenario]?",
    "When deadlines are tight, I feel [emotion]. It might help to [adjustment]."
  ],
  "alert": [
    "I'm feeling overwhelmed. Can we take a break and revisit this?",
    "I need some time to process this. Can we continue later?",
    "I'm noticing some tension. Let's pause and reconnect.",
    "I want to respond thoughtfully. Give me a moment to collect my thoughts.",
    "I feel my emotions rising. Can we step away for a few minutes?",
    "This is getting intense. Let's pause and come back when calmer.",
    "I need a short breather to think clearly. Can we pick this up in 10 minutes?",
    "I'm sensing frustration. Let's take a moment to reset.",
    "My stress is high right now. Would it help to pause and regroup?",
    "I want to give you my full attention. Can I take a brief break first?",
    "I'm feeling pressed. Let's table this and return with fresh minds.",
    "I need a moment to breathe. Can we circle back shortly?",
    "I'm overwhelmed by this topic. Can we pick a better time to discuss?",
    "I'm feeling tense. Let's pause and revisit after a quick break.",
    "My head is spinning. Can we hit pause and resume later?",
    "I'd like to respond more calmly. Can we pause and reconvene?",
    "I'm getting flustered. Let's take five and then continue.",
    "I want to be fair to both of us. Can we pause for clarity?",
    "I need to gather my thoughts. How about we take a short break?",
    "I'm feeling overloaded. Let's step away and come back in a bit.",
    "I want to ensure I'm clear. Can I have a moment to think?",
    "This is a lot right now. Can we pause and then talk again?",
    "I'm feeling anxious. Let's take a moment to breathe together.",
    "I need to calm down before proceeding. Can we pause for a bit?",
    "I'd like to avoid saying something I'll regret. Let's take a timeout.",
    "I'm feeling distressed. Would it be okay to pause for now?",
    "I want to be thoughtful. May we pause and return shortly?",
    "I'm emotionally taxed. Can we take a break before continuing?",
    "I need a moment to settle my mind. Let's pause here.",
    "I'm feeling strained. Let's step aside and return with fresh eyes.",
    "I'd like to be fully present. Can we table this for now?",
    "I'm having trouble focusing. Let's take a short break to regroup."
  ],
  "caution": [
    "I'm concerned about [specific issue]. Can we address this?",
    "I want to make sure we're on the same page about [topic].",
    "Let me clarify what I'm hearing: [paraphrase]. Is that right?",
    "I'm sensing some disconnect. Can we explore this together?",
    "I notice some confusion around [topic]. Can we go over it again?",
    "I want to ensure I understand your view on [issue]. Could you elaborate?",
    "It seems we may have different perspectives. Can we align on [point]?",
    "I want to avoid misunderstanding. Can you help me clarify [detail]?",
    "I'm picking up some hesitation. Is there something on your mind?",
    "I want to confirm our next steps on [task]. Does this plan work for you?",
    "Can we revisit [topic]? I want to be certain we agree.",
    "I feel there's some ambiguity. Could we define [term] more clearly?",
    "I want to check my understanding: You're saying [paraphrase]—correct?",
    "I'm a bit uneasy about [issue]. Can we talk it through?",
    "I want to prevent miscommunication. Can we outline our expectations?",
    "Would you mind if I restated your point to ensure I got it right?",
    "I sense we might be veering off. Can we refocus on [goal]?",
    "Let's review what we've decided so far. Does everything look right?",
    "I want to be thorough. Can we confirm the details of [agreement]?",
    "It sounds like we may be missing something. What are we overlooking?",
    "I'm not entirely clear on [aspect]. Could you clarify it for me?",
    "I'd like to verify my notes on [topic]. Can we cross-check?",
    "I want to make sure we both feel heard. Is there anything I missed?",
    "It seems we have different assumptions. Can we discuss those?",
    "I want to ensure this solution works for you. Any concerns?",
    "Let's double-check our understanding of [policy/process]. Are we aligned?",
    "I'm cautious about moving forward without clarity on [point]. Thoughts?",
    "I'd like to confirm our priorities. Are we agreed that [priority] comes first?",
    "I feel uncertain about [detail]. Could we unpack that together?",
    "Let's verify we both agree on the timeline for [project]. Is it clear?",
    "I want to make sure you're comfortable with [decision]. Any tweaks?",
    "Before we proceed, can we confirm that [requirement] is met?",
    "I sense some hesitation about [plan]. What's causing the uncertainty?",
    "I'd like to get your input on [solution] before we finalize.",
    "I want to ensure fairness. Do you feel this approach works for everyone?",
    "Let me check that I've captured your concerns correctly: [paraphrase].",
    "I want to avoid surprises. Can we list any potential issues first?",
    "I'm a bit worried about [risk]. How should we mitigate it?",
    "Could we do a quick recap of what we've agreed on so far?",
    "I'd like to validate our assumptions on [topic]. Are they all sound?",
    "Let's pause to ensure our definitions match. How do you define [term]?",
    "I want to ensure we haven't overlooked any details related to [topic].",
    "Can we agree on the next action items so that we're both clear?"
  ]
}