{
    "repairScripts": {
        "anxious": [
            "I realize I may have come across as overwhelming. Can we take a step back and talk about this calmly?",
            "I'm sorry if I sounded needy just now. I want to understand how you feel.",
            "I know I've been worrying a lot. Can we pause so I can collect my thoughts?",
            "I feel like I might be overreacting. Can you help me see where you're coming from?",
            "I'm aware my tone got urgent. Would you share what you're experiencing too?",
            "I'm sorry for pushing for reassurance. Can we find a different way to stay connected?",
            "I realize I've been anxious about us. Let's set a quick check-in plan together.",
            "I know my questions may feel repetitive. Thank you for your patience with me.",
            "I'm feeling insecure right now. Could we agree on a small signal that you're okay?",
            "I apologize if I came across as clingy. What pace feels comfortable for you?",
            "I can tell my worry is showing. Can we talk about how we can both feel safe?",
            "I didn't mean to overwhelm you with my concerns. Can we pick one issue to focus on?",
            "I'm sorry for the barrage of messages. Please let me know when a good time is to chat.",
            "I know I jump to worst-case scenarios. Could you reassure me or correct me now?",
            "I feel unsettled and I'm sorry if it's too much. How can we reestablish calm?",
            "I realize I've been seeking constant updates. Can we find a steady rhythm that works?",
            "I'm worried my neediness is pushing you away. Can we talk about how to balance this?",
            "I'm sorry for sounding panicked. Would stepping through this one point at a time help?",
            "I know my uncertainty is loud. Could you tell me one thing that's going well?",
            "I apologize for my anxious questions. What do you need from me to feel supported?"
        ],

        "avoidant": [
            "I know I've been distant. Can we reconnect now and talk about what matters?",
            "I'm sorry if I pulled away. Your feelings are important to me, let's discuss them.",
            "I realize my quietness may have hurt you. Can we find a way to stay connected?",
            "I didn't mean to shut down. I want to hear your perspective if you're willing to share.",
            "I understand my need for space can feel cold. Can we agree on check-in times?",
            "I'm sorry for stepping back abruptly. Could we plan a time to talk it through?",
            "I see I created distance. Your voice matters to me, can we pick this up together?",
            "I've been avoiding because I felt overwhelmed. Can you help me ease back into this?",
            "I know my silence can feel like indifference. Please know I care and want to talk.",
            "I realize I've been hiding. Can we set a brief window to reconnect today?",
            "I'm sorry if I seemed unresponsive. Your thoughts mean a lot, can you share again?",
            "I understand I went quiet. Would you let me know when you're free so I can listen?",
            "I didn't want to argue, so I withdrew. Can we instead find a calm way to discuss?",
            "I regret pulling away. Could we agree on a quick signal when either of us needs a break?",
            "I see my need for solitude caused worry. Can we agree on how to handle that next time?",
            "I'm sorry for needing space without notice. How can I make this easier for you?",
            "I know I've been emotionally distant. Can we plan a brief catch-up to rebuild trust?",
            "I withdrew to think. Please tell me how I can better support you when I come back.",
            "I realize I've prioritized quiet over connection. Can we set a compromise that works?",
            "I apologize for my distance. Would a short daily check-in help you feel more secure?"
        ],

        "disorganized": [
            "I realize I've been all over the place. Can we slow down and take it one step at a time?",
            "I'm sorry if I seemed unpredictable. Your feelings matter, let's work through this together.",
            "I know my thoughts jumped around. Can you help me clarify what's most important right now?",
            "I feel torn and I may have mixed signals. Can we pause and realign on where we stand?",
            "I apologize for my confusion. Could we pick one topic and focus there first?",
            "I realize I switched topics abruptly. Please let me know if I lose track, and we'll refocus.",
            "I'm sorry for flip-flopping. Can we agree on a structured approach to this conversation?",
            "I know I seem scattered. Would it help if I wrote down my main points before we continue?",
            "I'm sorry for the emotional whiplash. Can we establish a clear order for our discussion?",
            "I realize I may have overwhelmed you with too many concerns. Let's choose one to address now.",
            "I apologize for bouncing around. Could you ask me one question at a time so I can answer thoughtfully?",
            "I know my anxiety and confusion showed. Can we take a brief break and then revisit calmly?",
            "I'm sorry if my mixed messages upset you. How can we create a clearer path forward?",
            "I realize I haven't been straightforward. Can I restate my main point more clearly?",
            "I feel both anxious and scattered. Would a simple agenda help us stay on track?",
            "I apologize for my inconsistent tone. Let's agree on check-in pauses so neither of us feels lost.",
            "I know I spiraled between topics. Could we summarize where we are before moving on?",
            "I'm sorry for the back-and-forth. Can we set a mutual signal to pause and refocus if needed?",
            "I realize I sounded erratic. What's one thing you'd like me to clarify right now?",
            "I apologize for my jumbled thoughts. Can you tell me what you heard, so I can correct any misunderstandings?"
        ],
        "secure": [
            "I want to make sure I heard you correctly. Can we review what we've agreed on?",
            "I'm sorry if I misunderstood. Please tell me how you see it, and I'll adjust.",
            "Thank you for sharing that. Let me restate what I heard to confirm we're aligned.",
            "I realize I may have missed something. What would you add or change in what I said?",
            "I appreciate your patience. Could we revisit any point that didn't land well?",
            "I value our conversation. Can we check in on how you're feeling about this?",
            "I didn't mean to gloss over your concern. Can you help me understand it better?",
            "I want to ensure we both feel heard. What's one thing you'd like clarified?",
            "Let me know if any part of that felt off. Your feedback helps me improve.",
            "I care about your perspective. Could you share any thoughts I might have overlooked?",
            "Thank you for pointing that out. Let me correct my wording so it's clearer.",
            "I apologize if I came across as dismissive. What's the right way to express this?",
            "I want this to work for both of us. What adjustment would you suggest?",
            "I'm committed to understanding. Can you tell me if anything I said needs more context?",
            "I may have phrased that poorly. How would you prefer I say it?",
            "Your input matters. Can we refine that statement together?",
            "I'm here to listen. Let me know if I need to clarify any detail.",
            "I appreciate your honesty. What could I do differently to be clearer next time?",
            "I realize I might have rushed that explanation. Can I walk through it more slowly?",
            "I want to get this right. What part would you like me to expand on?"
        ]
    }
}