{
    "repairStrategies": [
        {
            "trigger": ["alert", "aggressive"],
            "strategies": [
                "I didn't mean to sound harsh; can I try that again?",
                "Let me step back and say that more clearly.",
                "I realize that was blunt; here's what I actually mean…",
                "Sorry, that was harsh—thank you for hearing me out.",
                "I'd like to correct myself: I feel … when …",
                "Pardon my tone—what I wanted to say is…",
                "I apologize if that stung—can we start fresh?",
                "That sounded accusatory; let me soften it.",
                "I misspoke. Here's a clearer way to put it…",
                "I'm sorry for the blunt words—my intention was…",
                "I realize that was intense—shall I try again more calmly?",
                "Let me reframe that in a more understanding way.",
                "I regret the harsh phrasing—please allow me to clarify.",
                "My apologies for coming on strong; here's a better phrasing…",
                "That might have sounded rude—I'm truly sorry.",
                "That came out wrong—what I mean is…",
                "I'm sorry if I upset you—can we talk this through?",
                "I didn't express that well—let me try again.",
                "I realize my words were sharp—thank you for bearing with me.",
                "Excuse the tone—here's what I intended to convey…",
                "Forgive the abruptness—allow me to restate.",
                "My words were off—let me correct that.",
                "I regret sounding dismissive—let me elaborate.",
                "That came out stronger than intended—can I rephrase?",
                "I apologize for the edge in my voice—here's a gentler approach.",
                "I know that was abrupt—what I meant was…",
                "Pardon my bluntness—may I retry?",
                "Let me dial that back and try again.",
                "I'm sorry for the rough phrasing—here's a smoother version.",
                "That was sharper than intended—please let me clarify.",
                "I apologize for sounding curt—what I really mean is…",
                "Let me soften that: I care about…",
                "My tone was off—this is what I want to say…",
                "I didn't mean to come off strong—let's try this…",
                "Thanks for your patience—here's a clearer statement…",
                "I'm sorry for the tough wording—can we revisit?",
                "I want to rephrase that with more empathy…",
                "Please excuse my tone—may I clarify?",
                "I spoke too sharply—let me explain gently…"
            ]
        },
        {
            "trigger": ["caution"],
            "strategies": [
                "I realize that might've come off strong--can I rephrase?",
                "Perhaps I could explain that more gently?",
                "Would it help if I shared why I feel this way?",
                "Let me soften that: I'm wondering if we might...",
                "I didn't mean to demand--could you let me know when you can?",
                "Sorry if that sounded pushy--can we try a different approach?",
                "I'm aware that was a bit forceful--how about I ask it this way?",
                "I realize I used 'must'--could I reframe that as a request?",
                "Could I add a quick reason to help clarify why I'm asking?",
                "I see that came across as urgent--would a later time work better?",
                "I didn't intend to rush you--please let me know what timing suits you.",
                "That may have sounded abrupt--let me phrase it more softly.",
                "I want to be respectful of your time--when would you like to tackle this?",
                "I know that sounded like a directive--can we treat it as a suggestion instead?",
                "I feel like I might be coming on too strong--shall I dial it back?",
                "I apologize if it sounded demanding--could you tell me your preference?",
                "I'm sorry for the blunt tone--what would a gentler ask look like?",
                "Let me tweak that to sound more collaborative: 'Could we...?'",
                "I realize 'now' can feel pressuring--would 'when you have a chance' be better?",
                "I don't want to overwhelm you--let me know if you need more time.",
                "That sounded like a must--can I change it to 'when you're ready'?",
                "I'm aware that was directive--could I reword it as an option?",
                "I'm sorry if that felt abrupt--how can I phrase this to feel supportive?",
                "Let me add a 'please' to make it less demanding: 'please...'",
                "I appreciate you--could you let me know when you'd like to discuss?",
                "I realize that sounded like an order--can we treat it as a preference?",
                "Would it help if I suggested a couple of time slots instead?",
                "I'd like your input--when would be a good time for you?",
                "I don't want to pressure you--just let me know what works.",
                "I feel that came across as a demand--may I rephrase it as a question?",
                "I apologize if it felt urgent--'at your convenience' might be more fitting."
            ]
        },
        {
            "trigger": ["miscommunication", "unclear"],
            "strategies": [
                "I think I wasn't clear--what I meant was...",
                "Let me restate that so there's no confusion.",
                "Sorry for the ambiguity--here's exactly what I was trying to say...",
                "Can I clarify? I intended to express...",
                "I realize that might have been confusing--let me unpack it.",
                "I'm concerned I didn't explain it well--here's a clearer version...",
                "Let me break that down step by step so it's easier to follow.",
                "I may have skipped a detail--here's the missing piece...",
                "I think I jumped ahead--let me fill in the background first.",
                "I realize that was vague--let me give you a concrete example.",
                "Could you tell me which part felt unclear so I can clarify?",
                "I want to make sure we're on the same page--can I rephrase?",
                "I might have used jargon--here's that in simpler terms...",
                "I worry I wasn't specific enough--here's exactly what I mean: ...",
                "Let me summarize in one sentence to ensure it's clear.",
                "I know that was a lot--can I highlight the key point again?",
                "I think I conflated two ideas--let me separate them clearly.",
                "I realize I spoke too quickly--let me slow down and explain again.",
                "Sorry if that sounded disjointed--here's a coherent recap.",
                "I may have lost my train of thought--here's the intended message."
            ]
        },
        {
            "trigger": ["defensive"],
            "strategies": [
                "I'm sorry--I didn't mean to get defensive. Can we start over?",
                "Let me try that again without sounding like I'm blaming you.",
                "I see I got defensive; what I really want to express is...",
                "I apologize for reacting too quickly--please let me hear you out.",
                "I realize I was taking that personally--here's what I actually mean...",
                "I'm getting defensive--can we pause so I can gather my thoughts?",
                "Sorry if that came across as dismissive. I value your perspective.",
                "I noticed I shut down just now--can we revisit that point calmly?",
                "I don't want to argue--let me rephrase my concern more clearly.",
                "I caught myself interrupting--please go ahead, and I'll listen fully.",
                "That sounded defensive--thank you for your patience while I try again.",
                "I realize I was deflecting--what I'm trying to say is...",
                "I'm sorry for raising my tone--let me speak more calmly.",
                "I felt attacked and I flinched--can we talk through it together?",
                "I reacted defensively--can you help me understand your view better?",
                "I'm aware I put up walls--let me take them down and listen.",
                "I'm sorry for the abrupt reaction--what were you trying to share?",
                "I realize I'm on the defensive--please bear with me as I restate.",
                "I don't want to be combative--what I want to say instead is...",
                "I see I got tense--let me soften my words and try again."
            ]
        },
        {
            "trigger": ["withdrawing", "shutting down"],
            "strategies": [
                "I'm sorry for going quiet--can we pick this up now?",
                "I withdrew too abruptly; I care about what you're saying.",
                "My silence wasn't fair--let's restart this conversation.",
                "I realize I backed away--could you tell me how you feel?",
                "I pulled back without warning--can we try again with more notice?",
                "I shut down when things heated up--let's pause and then resume gently.",
                "I see I retreated just now--I want to stay engaged. Where were we?",
                "I'm sorry for disconnecting--your thoughts matter to me, please continue.",
                "I went quiet because I felt overwhelmed--can you help me stay present?",
                "I shouldn't have checked out--let's restart so I can really listen.",
                "My silence wasn't a solution--can we approach this another way?",
                "I realize stepping back hurt you--let's find a way to keep talking.",
                "I'm here now and ready to listen--what can I do to stay engaged?",
                "I'm sorry for the abrupt pause--your view is important, let's continue.",
                "I shut down too quickly--can you help me stay in this conversation?",
                "I know I went dark--can we set a signal so I don't disappear again?",
                "I regret retreating--let's create a plan so I can stay involved.",
                "I stepped away when it got tough--thank you for waiting, let's continue."
            ]
        },
        {
            "trigger": ["pursuing", "pressure"],
            "strategies": [
                "I see I'm pressing too hard--take your time and let me know when you're ready.",
                "I apologize for the rapid follow-ups--no rush. We can talk when you can.",
                "I realize I've been pushy--can we pause and resume later?",
                "Sorry if I overwhelmed you--please let me know what pace works.",
                "I didn't mean to crowd you--let me know when you'd like to pick this up.",
                "I understand you need space--feel free to respond when it's convenient.",
                "I've been eager for your reply--I'll step back and wait for you.",
                "I'm sorry for the constant check-ins--take the time you need.",
                "I realize my follow-ups might feel suffocating--I'll wait for you to reach out.",
                "I know I'm persistent--please tell me if you need a break.",
                "I didn't intend to pressure you--what timing feels comfortable for you?",
                "I'm sorry for the urgency--there's no deadline except what works for you.",
                "I see my eagerness might be too much--let's set a check-in schedule together.",
                "I apologize for the repeated messages--I'll pause until I hear from you.",
                "I know silence can feel safer--text me when you're ready to reconnect.",
                "I'm sorry if I've been demanding--please let me know your preferred rhythm.",
                "I realize I've been hounding you--consider this space until you're ready.",
                "I want to respect your pace--just ping me when you feel up to chatting.",
                "I'm sorry for the constant pings--no rush at all.",
                "I respect your time--reply whenever works best for you."
            ]
        },
        {
            "trigger": ["neutral"],
            "strategies": [
                "I feel we left something unsaid--could I check if I've missed anything?",
                "I don't want us to gloss over this--can we make sure we're on the same page?",
                "I realize we haven't addressed how you feel--what's your take?",
                "Let's add some clarity--what's most important to you here?",
                "I want to ensure I understood--can you tell me your perspective again?",
                "It seems like I might have skipped a step--what else should we cover?",
                "Can we pause to review our next actions so nothing falls through the cracks?",
                "I want to be thorough--are there any points you'd like to revisit?",
                "Let's summarize what we've agreed on so far--does that capture it?",
                "Before we finish, is there anything else you think we should discuss?",
                "I'd like to confirm we're aligned--what stands out most to you?",
                "I want to double-check my understanding--did I miss any concerns?",
                "Let's make sure we both feel comfortable--any lingering questions on your side?",
                "I want to wrap this up clearly--what's your main takeaway?",
                "Can we agree on the key next steps so we both know what's coming?"
            ]
        }
    ]
}