{
  "urgencyLevels": {
    "crisis": {
      "advice": "This situation requires immediate professional intervention. Please consider contacting a crisis counselor, emergency services, or a trusted mental health professional right away.",
      "followUp": [
        "Contact a crisis hotline (e.g., 988 in the U.S.) if you feel unsafe or overwhelmed",
        "Reach out to a trusted friend or family member and let them know you need support",
        "Consider going to the nearest emergency department if you feel in danger",
        "Schedule an urgent appointment with a licensed therapist or psychiatrist",
        "Use grounding techniques (5-4-3-2-1) until help arrives",
        "Create a safety plan: identify safe places, people, and coping tools",
        "Keep your phone charged and on hand for immediate contact",
        "Alert your partner that you need professional help immediately",
        "Write down three reasons to stay safe and review them often",
        "Use a crisis chat service (e.g., Crisis Text Line: text HOME to 741741)"
      ]
    },
    "high": {
      "advice": "This situation needs prompt attention within the next 24–48 hours. Consider professional support and focused self-care strategies.",
      "followUp": [
        "Schedule a couple's therapy session or coaching appointment this week",
        "Block out 60-90 minutes for an uninterrupted conversation in a calm setting",
        "Practice a soothing regulation exercise (e.g., box breathing) daily until resolved",
        "Agree on a “cool-down” ritual: a 30-minute break before re-engaging",
        "Reach out to a mentor, coach, or trusted peer for perspective",
        "Review and revisit your shared communication charter",
        "Set a goal to identify and name one underlying need each day",
        "Use a shared digital note to capture emotions and track progress",
        "Plan a self-care activity (nature walk, meditation) within 24 hours",
        "Create a mini “repair kit”: favorite song, comforting object, supportive text"
      ]
    },
    "moderate": {
      "advice": "This situation deserves thoughtful attention over the next few days. You can plan, reflect, and address it in a structured way.",
      "followUp": [
        "Block out 30 minutes in the next 2-3 days for a focused check-in",
        "Journal three things you value about your partner before talking",
        "Use a simple agenda: topic, feelings, needs, and next steps",
        "Practice one new communication skill (e.g., mirroring) during that talk",
        "Review your personal triggers and share one insight with your partner",
        "Set a reminder to practice a calming ritual before your conversation",
        "Identify the outcome you both want and write it down together",
        "Use a “plus/delta” exercise after the talk to note what worked and what to change",
        "Agree on a follow-up check-in one week later to assess progress",
        "Share one self-care commitment you each will uphold until then"
      ]
    },
    "low": {
      "advice": "This is manageable and can be addressed when both of you have the emotional space. Use it as an opportunity to reinforce your communication habits.",
      "followUp": [
        "Schedule a brief 10-minute check-in at a convenient time this week",
        "Notice and celebrate one positive communication moment today",
        "Practice active listening in a low-stakes context (e.g., planning dinner)",
        "Use this as skill-building: try an “I feel… when… because…” statement",
        "Send a supportive text or note acknowledging the conversation ahead",
        "Reflect on past successes in resolving minor tensions",
        "Share a light-hearted ritual (coffee date, walk) to reinforce connection",
        "Keep a running list of small communication wins to review monthly",
        "Experiment with a new grounding cue (e.g., circle your wrist three times) before talking",
        "Plan a fun activity together afterward as a reward for addressing issues"
      ]
    }
  }
}